.. _amka_userguide:

AMKA Strings
============

Introduction
------------

The function :func:`clean_gr_amka() <dataprep.clean.clean_gr_amka.clean_gr_amka>` cleans a column containing Greek social security number (AMKA) strings, and standardizes them in a given format. The function :func:`validate_gr_amka() <dataprep.clean.clean_gr_amka.validate_gr_amka>` validates either a single AMKA strings, a column of AMKA strings or a DataFrame of AMKA strings, returning `True` if the value is valid, and `False` otherwise.

AMKA strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "01013099997"
* `standard`: AMKA strings with proper whitespace in the proper places. Note that in the case of AMKA, the compact format is the same as the standard one.
* `birthdate`: split the date parts from the number and return the birth date, like "1930-01-01".
* `gender`: get the person's birth gender ('M' or 'F').

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_gr_amka()` and `validate_gr_amka()`.

### An example dataset containing AMKA strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "amka": [
            '01013099997',
            '01013099999',
            '7542011030',
            '7552A10004',
            '8019010008',
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

          amka                                           address
0  01013099997                                     123 Pine Ave.
1  01013099999                                           main st
2   7542011030                      1234 west main heights 57033
3   7552A10004                    apt 1 789 s maple rd manhattan
4   8019010008                robie house, 789 north main street
5        hello         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NULL                                             hello

## 1. Default `clean_gr_amka`

By default, `clean_gr_amka` will clean amka strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_gr_amka
clean_gr_amka(df, column = "amka")

          amka                                           address   amka_clean
0  01013099997                                     123 Pine Ave.  01013099997
1  01013099999                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_gr_amka(df, column = "amka", output_format="standard")

          amka                                           address   amka_clean
0  01013099997                                     123 Pine Ave.  01013099997
1  01013099999                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `compact`

In [4]:
clean_gr_amka(df, column = "amka", output_format="compact")

          amka                                           address   amka_clean
0  01013099997                                     123 Pine Ave.  01013099997
1  01013099999                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `birthdate`

In [5]:
clean_gr_amka(df, column = "amka", output_format="birthdate")

          amka                                           address  amka_clean
0  01013099997                                     123 Pine Ave.  1930-01-01
1  01013099999                                           main st         NaN
2   7542011030                      1234 west main heights 57033         NaN
3   7552A10004                    apt 1 789 s maple rd manhattan         NaN
4   8019010008                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

### `gender`

In [6]:
clean_gr_amka(df, column = "amka", output_format="gender")

          amka                                           address amka_clean
0  01013099997                                     123 Pine Ave.          M
1  01013099999                                           main st        NaN
2   7542011030                      1234 west main heights 57033        NaN
3   7552A10004                    apt 1 789 s maple rd manhattan        NaN
4   8019010008                robie house, 789 north main street        NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles        NaN
7         NULL                                             hello        NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned AMKA strings is added with a title in the format `"{original title}_clean"`.

In [7]:
clean_gr_amka(df, column="amka", inplace=True)

    amka_clean                                           address
0  01013099997                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [8]:
clean_gr_amka(df, "amka", errors="coerce")

          amka                                           address   amka_clean
0  01013099997                                     123 Pine Ave.  01013099997
1  01013099999                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `ignore`

In [9]:
clean_gr_amka(df, "amka", errors="ignore")

          amka                                           address   amka_clean
0  01013099997                                     123 Pine Ave.  01013099997
1  01013099999                                           main st  01013099999
2   7542011030                      1234 west main heights 57033   7542011030
3   7552A10004                    apt 1 789 s maple rd manhattan   7552A10004
4   8019010008                robie house, 789 north main street   8019010008
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        hello
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 4. `validate_gr_amka()`

`validate_gr_amka()` returns `True` when the input is a valid AMKA. Otherwise it returns `False`.

The input of `validate_gr_amka()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_gr_amka()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_gr_amka()` returns the validation result for the whole DataFrame.

In [10]:
from dataprep.clean import validate_gr_amka
print(validate_gr_amka('01013099997'))
print(validate_gr_amka('01013099999'))
print(validate_gr_amka('7542011030'))
print(validate_gr_amka('7552A10004'))
print(validate_gr_amka('8019010008'))
print(validate_gr_amka("hello"))
print(validate_gr_amka(np.nan))
print(validate_gr_amka("NULL"))

True
False
False
False
False
False
False
False

### Series

In [11]:
validate_gr_amka(df["amka"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: amka, dtype: bool

### DataFrame + Specify Column

In [12]:
validate_gr_amka(df, column="amka")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: amka, dtype: bool

### Only DataFrame

In [13]:
validate_gr_amka(df)

    amka  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False